// Виведіть в консоль числа від 1 до n використовуючи цикл for. (Дано: n = 10)
// for (let i = 1; i < 10 ; i ++) {
//     console.log(i)
// }

// Напишіть цикл, який обчислює суму чисел від 1 до n. (Дано: n = 100)
// let counter = 0;
// for(let i=1; i<101; i++){
//     if(i%2==0){
//         counter +=i;
//     }
// }
// console.log(counter);

// Використовуючи цикл while, виведіть в консоль числа від n до 1. (Дано: n = 10)
// let n = 10;
// while (n >= 1) {
//     console.log(n);
//     n--;
// }

// Напишіть цикл, який виводить всі парні числа від 1 до n. (Дано: n = 50)
// let n = 50
// for (let i = 2; i <= n; i += 2){
//     console.log(i);
// }

// Виведіть в консоль таблицю множення від 1 до n використовуючи вкладені цикли. (Дано: n = 10)
